#Дан номер дня недели. Выведите название дня недели.
A=int(input('Введите день недели'))
if A==1:
    print('Понедельник')
if A==2:
    print('Вторник')
if A==3:
    print('Среда')
if A==4:
    print('Четверг')
if A==5:
    print('Пятница')